public class Main {
    public static void main(String[] args) {
        CarShowroom.returnCarShowroomList();
    }
}
//1. Створити систему типів для реалізації доменної області "Автосалон". У салоні можуть знаходитися автомобілі різних типів
// Унікальними характерними особливостями. При реалізації використовувати як композицію, і успадкування.
//2. Для одного з типів нашої системи перевизначити toString, equals, hashCode власноруч (без автогенерації).
//3. Для решти інших типів те саме, що і в 2, але з автогенерацією.
